# Ввод-вывод и базовые переменные

# Задание № 1
sVid = input("Введите вид питомца: ")
nAgree = input("Введите возраст питомца: ")
sSName = input("Введите кличку питомца: ")
print("Это",sVid,"по кличке \""+sSName+"\".","Возраст:",nAgree,"года/лет.")

# Задание № 2
# дриопитек, рамапитек, австралопитек, Homo Habilis, Homo Erectus, 
# Homo Sapiens Neanderthalensis и, наконец, Homo Sapiens Sapiens 
sStage1 = input("Введите 1-й этап развития человека:")
sStage2 = input("Введите 2-й этап развития человека:")
sStage3 = input("Введите 3-й этап развития человека:")
sStage4 = input("Введите 4-й этап развития человека:")
sStage5 = input("Введите 5-й этап развития человека:")
sStage6 = input("Введите 6-й этап развития человека:")
sStage7 = input("Введите 7-й этап развития человека:")
print(sStage1,sStage2,sStage3,sStage4,sStage5,sStage6,sStage7, sep = " => ")